backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape:
      - null
      - 729
      dtype: float32
      name: dense_input
      ragged: false
      sparse: false
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      batch_input_shape:
      - null
      - 729
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-05
      name: dense
      trainable: true
      units: 2
      use_bias: true
  name: sequential
keras_version: 2.12.0
